{
  "_class_name": "UNetMV2DConditionModel",
  "_diffusers_version": "0.19.3",
  "_name_or_path": "/home/xiaoxiao/Workplace/wonder3Dplus/ckpts",
  "act_fn": "silu",
  "addition_embed_type": null,
  "addition_embed_type_num_heads": 64,
  "addition_time_embed_dim": null,
  "attention_head_dim": 8,
  "block_out_channels": [
    320,
    640,
    1280,
    1280
  ],
  "cd_attention_last": false,
  "cd_attention_mid": true,
  "center_input_sample": false,
  "class_embed_type": "projection",
  "class_embeddings_concat": false,
  "conv_in_kernel": 3,
  "conv_out_kernel": 3,
  "cross_attention_dim": 768,
  "cross_attention_norm": null,
  "cross_domain_attention": false,
  "down_block_types": [
    "CrossAttnDownBlockMV2D",
    "CrossAttnDownBlockMV2D",
    "CrossAttnDownBlockMV2D",
    "DownBlock2D"
  ],
  "downsample_padding": 1,
  "dual_cross_attention": false,
  "encoder_hid_dim": null,
  "encoder_hid_dim_type": null,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 8,
  "joint_attention": false,
  "joint_attention_twice": true,
  "layers_per_block": 2,
  "mid_block_only_cross_attention": null,
  "mid_block_scale_factor": 1,
  "mid_block_type": "UNetMidBlockMV2DCrossAttn",
  "multiview_attention": true,
  "mvcd_attention": false,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "num_attention_heads": null,
  "num_class_embeds": null,
  "num_views": 6,
  "only_cross_attention": false,
  "out_channels": 4,
  "projection_class_embeddings_input_dim": 10,
  "resnet_out_scale_factor": 1.0,
  "resnet_skip_time_act": false,
  "resnet_time_scale_shift": "default",
  "sample_size": 32,
  "sparse_mv_attention": false,
  "time_cond_proj_dim": null,
  "time_embedding_act_fn": null,
  "time_embedding_dim": null,
  "time_embedding_type": "positional",
  "timestep_post_act": null,
  "transformer_layers_per_block": 1,
  "up_block_types": [
    "UpBlock2D",
    "CrossAttnUpBlockMV2D",
    "CrossAttnUpBlockMV2D",
    "CrossAttnUpBlockMV2D"
  ],
  "upcast_attention": false,
  "use_linear_projection": false
}
