{
  "_class_name": "HunYuan3DMVDPipeline",
  "_diffusers_version": "0.20.0",
  "_name_or_path": "./hunyuan3d/v72_s22k",
  "feature_extractor_vae": [
    "transformers",
    "CLIPImageProcessor"
  ],
  "ramping_coefficients": [
    0.00301829120144248,
    0.2204633206129074,
    0.21527841687202454,
    0.23498539626598358,
    0.1914631873369217,
    0.20188239216804504,
    0.19352824985980988,
    0.17249998450279236,
    0.15826298296451569,
    0.15236389636993408,
    0.13444548845291138,
    0.12044154852628708,
    0.12808501720428467,
    0.1271015852689743,
    0.13629068434238434,
    0.14516159892082214,
    0.15645112097263336,
    0.16885493695735931,
    0.18022602796554565,
    0.1958882212638855,
    0.21415705978870392,
    0.23056700825691223,
    0.2505834102630615,
    0.2574525773525238,
    0.275470107793808,
    0.2808215022087097,
    0.29953837394714355,
    0.2967497408390045,
    0.2883710563182831,
    0.3023308515548706,
    0.3054688572883606,
    0.32596179842948914,
    0.3225354254245758,
    0.3140765428543091,
    0.3288663625717163,
    0.3435625731945038,
    0.3342442810535431,
    0.32937031984329224,
    0.35734811425209045,
    0.3601177930831909,
    0.3517529368400574,
    0.3810708224773407,
    0.40007662773132324,
    0.4264647364616394,
    0.3977527916431427,
    0.4314143657684326,
    0.49558719992637634,
    0.4665665030479431,
    0.48960328102111816,
    0.5141982436180115,
    0.5230164527893066,
    0.5266074538230896,
    0.5456079840660095,
    0.5737904906272888,
    0.5882097482681274,
    0.6210350394248962,
    0.6530380845069885,
    0.6383244395256042,
    0.6792004704475403,
    0.6567418575286865,
    0.7517656683921814,
    0.736494243144989,
    0.7586457133293152,
    0.8130561709403992,
    0.9578766226768494,
    1.001284122467041,
    0.9404520988464355,
    1.004292368888855,
    0.9145274758338928,
    0.9771682620048523,
    1.0350638628005981,
    1.0265849828720093,
    1.0594775676727295,
    0.980824887752533,
    1.0715670585632324,
    1.0140161514282227,
    1.1983819007873535
  ],
  "safety_checker": [
    null,
    null
  ],
  "scheduler": [
    "diffusers",
    "EulerAncestralDiscreteScheduler"
  ],
  "unet": [
    "diffusers",
    "UNet2DConditionModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKL"
  ],
  "vision_encoder": [
    "transformers",
    "CLIPVisionModelWithProjection"
  ],
  "vision_encoder_2": [
    "transformers",
    "CLIPVisionModelWithProjection"
  ],
  "vision_processor": [
    "transformers",
    "CLIPImageProcessor"
  ]
}
