{
  "_class_name": "TripoSGPipeline",
  "_diffusers_version": "0.30.3",
  "feature_extractor_dinov2": [
    "transformers",
    "BitImageProcessor"
  ],
  "image_encoder_dinov2": [
    "transformers",
    "Dinov2Model"
  ],
  "scheduler": [
    "TripoSG.schedulers.scheduling_rectified_flow",
    "RectifiedFlowScheduler"
  ],
  "transformer": [
    "TripoSG.models.transformers.triposg_transformer",
    "TripoSGDiTModel"
  ],
  "vae": [
    "TripoSG.models.autoencoders.autoencoder_kl_triposg",
    "TripoSGVAEModel"
  ]
}
